#### ImageBackgroundSettings Members

---

|  |
| --- |
| ImageBackgroundSettings Class   Methods   Properties   See Also |

The  ImageBackgroundSettings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  BackgroundSettings  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BackgroundImageFit | The background image fit type. |
| Public property | FilePath | File path of the image for the rendering background. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  BackgroundSettings  .) |
| Public property | OffsetHeight | The vertical offset of the rendering image to the rendering region. |
| Public property | OffsetWidth | The horizontal offset of the rendering image to the rendering region. |

# See Also

ImageBackgroundSettings Class

Autodesk.Revit.DB Namespace